controllers/KatAutoController.php

    public function actionCreate()
    {
        $model = new KatAuto();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `kat_auto` (`model`, `color`, `price`) VALUES ('Porsche', 'yellow', '2 000 000 rub.')

    protected function findModel($id)
    {
        if (($model = KatAuto::findOne($id)) !== null) {
---
SELECT * FROM `kat_auto` WHERE `autoid`='7'